{
    "title": "AITA for stopping the car and causing my dad to miss his flight?",
    "post_body": "My 21 dad 55  visited from out of state. Our relationship has been rocky and only till recenty did I realize how toxic he was.For context vacationhanging out with my dad and brother 33 are stressful. They argue and rope me into it. They dont listen to what I have to say. If I zone out because I want to detach myself from the conflic my dad will yell and further escalate. Its an uptight vacation where everyone has to eat at a specific time where everyone hangsout with each other at a specific time and we have a curfew. My girlfriend has refused to hangoutvacation with my brother and dad because Im always alert theyre nice and the next thing theyre being meaninsultingyellingcontrolling. She said it reminded her of her dysfunctional family and would rather not deal with it. And she cautioned me to set boundaries she doesnt stop me from hanging out with them she doesnt want to tag along.Well my dad was going back and my brother and him wanted me to drive.So many times they argue in the car while I drive and I get roped in. Ive told them Ill stop and get out of the car before but they yell at me because my dad is going to miss his flight. I expressed to my girlfriend that this was bound to happen. She advised me to do it stop the car and just call her for a ride home.Well it happened. They had a yelling match whileI drove. I was getting heated. I asked 3x please stop arguing its distracting I will stop the car and get out.Nothing happened after the 3rd time. So I pulled over at a gas station and I called my girlfriend who gave me a ride back home.My dad and brother were angry and the whole time trying to convince me to drive them instead of driving themselves. In the end my dad missed his flight.Theyre both furious at me and calling me an ungrateful asshole and that he missed his flight because of me. And my brother said that that wasnt the right time to establish boundaries. My girlfriend said that its their problem and I gave them ample time to not be distracting.aita"
}